Repository: essambarghsh/wc-centralized-variation-price-manager
Catalog: languages/wc-centralized-variation-price-manager-*.po
Languages: ar

source: %d already correct
ar: %d صحيح بالفعل

source: %d differ
ar: يختلف %d

source: %d invalid
ar: %d غير صالح

source: %d unique variation combination found.
ar: تم العثور على %d من الانواع الفريدة

source: %d variation
ar: %d نوع

source: %d variation already has the correct price.
ar: يحتوي النوع %d بالفعل على السعر الصحيح.

source: %d variation updated
ar: تم تحديث %d

source: %s requires WooCommerce to be installed and active.
ar: %s يتطلب تثبيت وتفعيل WooCommerce.

source: , invalid: %d
ar: غير صالح: %d

source: Actions
ar: الإجراءات

source: Active Background Jobs
ar: عمليات خلفية نشطة

source: All variations updated successfully!
ar: تم تحديث جميع الانواع بنجاح!

source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.

source: Are you sure you want to cancel? Some variations may have already been updated.
ar: هل أنت متأكد من رغبتك في الإلغاء؟ قد تكون بعض الانواع قد تم تحديثها بالفعل.

source: Batch %1$d: Error - %2$s
ar: الدفعة %1$d: خطأ - %2$s

source: Batch %1$d: No updates needed (already correct: %2$d%3$s)
ar: الدفعة %1$d: لا حاجة إلى تحديثات (صحيحة بالفعل: %2$d%3$s)

source: Batch %1$d: Updated %2$d variations%3$s
ar: الدفعة %1$d: تم تحديث %2$d الانواع %3$s

source: Cancel
ar: إلغاء

source: Cancelled
ar: تم الإلغاء

source: Clear
ar: مسح

source: Close
ar: إغلاق

source: Completed!
ar: مكتمل!

source: Current Price
ar: السعر الحالي

source: Database error occurred.
ar: حدث خطأ في قاعدة البيانات.

source: Failed to cancel job.
ar: فشل إلغاء المهمة.

source: Invalid job ID.
ar: معرف الوظيفة غير صالح.

source: Job cancelled by user.
ar: تم إلغاء الطلب من قبل المستخدم.

source: Job cancelled.
ar: تم إلغاء الطلب.

source: Job not found.
ar: لم يتم العثور على الوظيفة.

source: Make sure you have variable products with variations in your WooCommerce store.
ar: تأكد من وجود منتجات متغيرة مع اختلافات في متجر WooCommerce الخاص بك.

source: Manage WooCommerce product variation prices from a centralized interface. Update prices for all products with the same variation combination at once.
ar: قم بإدارة أسعار منتجات WooCommerce المتنوعة من خلال واجهة مركزية. قم بتحديث أسعار جميع المنتجات التي لها نفس التركيبة المتنوعة في وقت واحد.

source: No active background jobs.
ar: لا توجد وظائف شاغرة في الخلفية.

source: No valid variations found.
ar: لم يتم العثور على أي انواع صالحة.

source: No variation combinations found.
ar: لم يتم العثور على أي أنواع.

source: No variations selected.
ar: لم يتم تحديد أي أنواع.

source: Permission denied.
ar: تم رفض الإذن.

source: Please enter valid prices (numbers only).
ar: يرجى إدخال سعر صحيحة (أرقام فقط).

source: Price update started.
ar: بدأ تحديث الأسعار.

source: Processing %1$d of %2$d variations
ar: معالجة %1$d من %2$d انواع

source: Processing...
ar: جاري المعالجة...

source: Products
ar: المنتجات

source: Regular Price
ar: السعر العادي

source: Regular price
ar: السعر العادي

source: Regular price cannot be negative.
ar: السعر العادي لا يمكن أن يكون سالباً.

source: Regular price must be a valid number.
ar: يجب أن يكون السعر العادي رقماً صحيحاً.

source: Sale Price
ar: سعر التخفيض

source: Sale price
ar: سعر التخفيض

source: Sale price cannot be negative.
ar: لا يمكن أن يكون سعر التخفيض سالباً.

source: Sale price must be a valid number.
ar: يجب أن يكون سعر البيع رقماً صالحاً.

source: Search
ar: بحث

source: Search variations...
ar: البحث عن الانواع...

source: Search variations:
ar: البحث

source: Started processing %d variations...
ar: بدء معالجة %d أنواع...

source: Starting...
ar: جاري البدء...

source: Synced %d parent products
ar: تمت مزامنة %d منتجًا رئيسيًا

source: These are combinations of attribute values assigned to variable products with specific prices
ar: هذه هي مجموعات من قيم السمات المخصصة لمنتجات متغيرة بأسعار محددة.

source: These are created under Products → Attributes (e.g., "Size", "Color")
ar: يتم إنشاؤها ضمن المنتجات → السمات (على سبيل المثال، ”الحجم“ و”اللون“)

source: These are the values for each attribute (e.g., for "Size": Small, Medium, Large)
ar: هذه هي القيم لكل سمة (على سبيل المثال، بالنسبة لـ ”الحجم“: صغير، متوسط، كبير)

source: This plugin updates prices based on SPECIFIC VARIATION COMBINATIONS in your products, NOT attribute terms directly. The same attribute value (e.g., "Red") may have different prices in different products or when combined with other attributes.
ar: تقوم هذه الإضافة بتحديث الأسعار بناءً على مجموعات الأنواع المحددة في منتجاتك، وليس بناءً على مصطلحات السمات مباشرةً. قد يكون لنفس قيمة السمة (على سبيل المثال، ”أحمر“) أسعار مختلفة في منتجات مختلفة أو عند دمجها مع سمات أخرى.

source: This will update %d variation(s). Continue?
ar: سيؤدي هذا إلى تحديث %d من الانواع. هل تريد المتابعة؟

source: Try a different search term or
ar: جرّب مصطلح بحث مختلف أو

source: Update
ar: تحديث

source: Updating Prices
ar: تحديث الأسعار

source: Updating...
ar: جاري التحديث...

source: Variation Combination
ar: الأنواع

source: Variation Prices
ar: سعر النوع

source: variations
ar: الأنواع

source: Variations with different prices
ar: أنواع مع اسعار مختلفة

source: view all variations
ar: عرض جميع الأنواع

source: WC Centralized Variation Price Manager
ar: مدير الأسعار المركزي لـ ووكمرس

source: WC Centralized Variation Price Manager requires WooCommerce to be installed and active.
ar: يتطلب مدير الأسعار المركزي لـ ووكمرس تثبيت WooCommerce وتفعيله.

source: You can close this page. Updates will continue in the background.
ar: يمكنك إغلاق هذه الصفحة. ستستمر التحديثات في الخلفية.

source: You do not have sufficient permissions to access this page.
ar: ليس لديك أذونات كافية للوصول إلى هذه الصفحة.
